I tried to reproduce this, but to no avail.
I took your code, created a `src` directory and placed some files in there. I ran a `terraform apply` to create the initial docker image.
Now I change the contents of one of the files inside `src`, run a `terraform plan` and it shows me the following
```
  # docker_image.zoo must be replaced
-/+ resource "docker_image" "zoo" {
      ~ id          = "sha256:471a1b8817eefb6569017c1a76f288e0d4e5c8476eb199485c469d0b033168bfzoo" -> (known after apply)
      ~ image_id    = "sha256:471a1b8817eefb6569017c1a76f288e0d4e5c8476eb199485c469d0b033168bf" -> (known after apply)
        name        = "zoo"
      + repo_digest = (known after apply)
      ~ triggers    = { # forces replacement
          ~ "dir_sha1" = "10a34637ad661d98ba3344717656fcc76209c2f8" -> "72833f1c7d3b80aadc836d5d035745ffa3a65894"
        }
```

As you can see, the `dir_sha1` changes.
Closing this, as I cannot reproduce